[
    {
        "name": "ASUS ROG Strix G17 Gaming Laptop, 17.3\" 300Hz IPS Type FHD, GeForce RTX 3070 8GB GDDR6 with ROG Boost, AMD Ryzen 9 5900HX, RGB Keyboard, W10, 32GB RAM | 2TB PCIe SSD, Tikbot HDMI Cable",
        "price": 5999.99,
        "description": "The ROG Strix G17 embodies streamlined design, offering a formidable core experience for serious gaming and multitasking on Windows 10. Featuring up to the latest 5th Gen AMD Ryzen CPU and a NVIDIA GeForce GPU, it offers high-FPS power that takes full advantage of up to a blazing fast display ROG RTX 30 Series Laptops GeForce RTX 30 Series powers the world's fastest laptops for gamers and creators. They're built with the award-winning Ampere —NVIDIA's 2nd gen RTX architecture —with new RT Cores, Tensor Cores, and streaming multiprocessors for the most realistic ray-traced graphics and cutting-edge AI features. Power Up with the Next Generation An ultrafast 300Hz refresh rate makes the flow of fast-paced action look impeccably smooth & minimizes motion blur for precision target tracking. The NVIDIA GeForce RTX GPU delivers smooth frame rates, while the AMD Ryzen 5000 series CPU powers through heavy lifting or multitasking Game at Professional Speed Play anywhere on a chassis that's up to 7% smaller and more portable than previous generations. Illuminate your environment with Aura Sync accents that shine from the metallic ROG logo, across the backlit keyboard, to the wraparound light bar. Reliable Wi-Fi Ultrafast Wi-Fi 6 (802.11ax) lets you game reliably at LAN speeds wherever compatible connections are available. ROG RangeBoost enhances reception by evaluating the signal strength of four internal antennas and then picking the best pair to use for your location. ROG Intelligent Cooling OG's Intelligent Cooling philosophy mixes the right features and system settings to ensure the best experience. Performance is boosted with cutting-edge enhancements like liquid metal compound on the CPU and a well-ventilated exterior that keeps noise levels lower than the last generation.",
        "ratings": 0.0,
        "images": [
            {
                "public_id": "1_qwp9wx",
                "url": "https://res.cloudinary.com/drgoeq3fd/image/upload/v1724855011/1_qwp9wx.jpg"
            },
            {
                "public_id": "6_yiliwn",
                "url": "https://res.cloudinary.com/drgoeq3fd/image/upload/v1724855011/6_yiliwn.jpg"
            },
            {
                "public_id": "3_ulc8qx",
                "url": "https://res.cloudinary.com/drgoeq3fd/image/upload/v1724855010/3_ulc8qx.jpg"
            },
            {
                "public_id": "2_iprk90",
                "url": "https://res.cloudinary.com/drgoeq3fd/image/upload/v1724855010/2_iprk90.jpg"
            },
            {
                "public_id": "4_rdbwj5",
                "url": "https://res.cloudinary.com/drgoeq3fd/image/upload/v1724855010/4_rdbwj5.jpg"
            },
            {
                "public_id": "5_okffji",
                "url": "https://res.cloudinary.com/drgoeq3fd/image/upload/v1724855010/5_okffji.jpg"
            },
            {
                "public_id": "7_erfoy3",
                "url": "https://res.cloudinary.com/drgoeq3fd/image/upload/v1724855010/7_erfoy3.jpg"
            }
        ],
        "category": "Electronics",
        "seller": "ASUS",
        "stock": 50,
        "numOfReviews": 0,
        "reviews": []
    },
    {
        "name": "ROCKROOSTER Woodland - Men's Waterproof Work Boots for Landscaping, Maintenance, Transportation and Utilities, Composite Toe, EH AK869",
        "price": 129.99,
        "description": "ROCKROOSTER BOOTS - Designed for spring, summer, autumn and winter. Whether in the jungle, in the desert or in public office, we provide all-day comfortable services for those who love outdoor activities and adventurous life.\n\nELECTRICAL HAZARD: Represents secondary protection to prevent accidental contact with circuits of 18,000 volts or less under dry conditions. The safety toe EH style complies with ASTM F2413-18 EH standard.\n\nCOMPOSITE SAFETY TOE: A composite (non-metallic) safety toe is used to identify protective measures to prevent impact and compression hazards. The composite toe meets the ASTM F2413-18 standard.\n\nHYDROGUARD WATERPROOF AND BREATHABLE PROTECTION: These boots are designed to be completely waterproof and can keep your feet dry in most wet conditions. Waterproof and breathable membrane can keep your feet dry, but can promote air circulation and circulation.\n\nRETURN POLICY WORRY FREE- If you are not satisfied with our boots, please find our rockrooster customer service through the order before complaining our return policy, we will provide you with a reasonable and satisfactory solution.",
        "ratings": 0.0,
        "images": [
            {
                "public_id": "1_q1szar",
                "url": "https://res.cloudinary.com/drgoeq3fd/image/upload/v1724857246/1_q1szar.jpg"
            },
            {
                "public_id": "2_jjuu1t",
                "url": "https://res.cloudinary.com/drgoeq3fd/image/upload/v1724857246/2_jjuu1t.jpg"
            },
            {
                "public_id": "3_iqmvfz",
                "url": "https://res.cloudinary.com/drgoeq3fd/image/upload/v1724857246/3_iqmvfz.jpg"
            },
            {
                "public_id": "5_cgtqpt",
                "url": "https://res.cloudinary.com/drgoeq3fd/image/upload/v1724857247/5_cgtqpt.jpg"
            },
            {
                "public_id": "4_t7iufi",
                "url": "https://res.cloudinary.com/drgoeq3fd/image/upload/v1724857247/4_t7iufi.jpg"
            }
        ],
        "category": "Fashion",
        "seller": "Woodland",
        "stock": 100,
        "numOfReviews": 0,
        "reviews": []
    },
    {
        "name": "Knife Sets for Kitchen with Block, HUNTER.DUAL 15 Pcs Kitchen Knife Set with Block Self Sharpening, Dishwasher Safe, Anti-slip Handle, Black",
        "price": 69.99,
        "description": "RKITCHEN KNIFE SET - This high quality kitchen knife set is stain and rust resistant and can be used with high frequency or after long periods of inactivity to fully utilize the life of the knives.\n\nALL-IN-ONE KITCHEN SET - 15-piece knife set includes. 8\" chef's knife, 8\" slicing knife, 7\" Santoku knife, 8\" serrated bread knife, 5\" utility knife, 3.5\" paring knife, 6 4.5\" serrated steak knives, 1 kitchen shear and hard wood knife block with built-in knife sharpener.\n\nSHARP KNIFE SET - Each of HUNTER.DUAL knives is carefully tuned to be the sharpest it can be and wears a built-in sharpener.\n\nDISHWASHER SAFE - The knife set can be washed in the dishwasher, easy and quick to operate, and dry the knife set after cleaning for easy storage, not taking up space.\n\nCRAFTSMANSHIP - Non-Stick and Rust Resistant - With a black coating that prevents oxidation of the steel, the kitchen knife set will last a long time and remain non-stick and rust resistant. The ergonomically designed handle provides a comfortable grip and the handle will no longer loosen or fall off.",
        "ratings": 0.0,
        "images": [
            {
                "public_id": "4_eyvmwz",
                "url": "https://res.cloudinary.com/drgoeq3fd/image/upload/v1724857738/4_eyvmwz.jpg"
            },
            {
                "public_id": "1_vqan6g",
                "url": "https://res.cloudinary.com/drgoeq3fd/image/upload/v1724857741/1_vqan6g.jpg"
            },
            {
                "public_id": "2_rdnlht",
                "url": "https://res.cloudinary.com/drgoeq3fd/image/upload/v1724857740/2_rdnlht.jpg"
            },
            {
                "public_id": "5_dx6wia",
                "url": "https://res.cloudinary.com/drgoeq3fd/image/upload/v1724857738/5_dx6wia.jpg"
            },
            {
                "public_id": "3_mlf0zv",
                "url": "https://res.cloudinary.com/drgoeq3fd/image/upload/v1724857739/3_mlf0zv.jpg"
            }
        ],
        "category": "Home and Kitchen",
        "seller": "HD KITCHEN",
        "stock": 150,
        "numOfReviews": 0,
        "reviews": []
    },
    {
        "name": "Percy Jackson and the Olympians Hardcover Boxed Set (Percy Jackson & the Olympians)",
        "price": 51.99,
        "description": "The complete Percy Jackson & the Olympians series in hardcover. A perfect gift for Percy fans, as well as readers just discovering this epic and blockbuster adventure.",
        "ratings": 0,
        "images": [
            {
                "public_id": "1_evfa56",
                "url": "https://res.cloudinary.com/drgoeq3fd/image/upload/v1724858015/1_evfa56.jpg"
            }
        ],
        "category": "Books",
        "seller": "Rick Riordan",
        "stock": 75,
        "numOfReviews": 0.0,
        "reviews": []
    },
    {
        "name": "Keppi Adjustable Dumbbells Set, 25lb/55lb Dumbbells with Anti-Slip Metal Handle for Exercise & Fitness Fast Adjust Weight for Full Body Workout Fitness",
        "price": 199.79,
        "description": "Five Dumbbells in One - You only need the space of 1-set dumbbell to get the training experience of 5 different weights. single dumbbell size: 14.2\"Lx7.5\"Wx6.3\"H. Enjoy the benefits of having a complete weight set in your home!\n\n1 Second Weight Adjustment - With Keppi's exclusive weight adjustment design, just turn the handle with one hand to adjust the weight of the dumbbells from 5lb to 25lb in 1 second! Enjoy more convenient adjustment experience and get better training efficiency.\n\nSafety Weight Dial System - The newly designed weight dial system holds the dumbbell plates firmly on the handle through 8 locking grooves ensuring the dumbbell set is firm and stable. This set up makes it stable and quiet during the movement which brings a new daily workout experience.\n\nHigh Quality and New Technology - Weight plates are made entirely of silicon steel with an ergonomic anti-slip handle of aluminum alloy. It is combined with a clicking sound when adjusting weight making dumbbells more durable, reliable, and safer during use.\n\nWhat You Get - KEPPI Adjustable Dumbbell, High Strength Tray, Owner's Manual, Includes a Worry-Free lifetime warranty, and friendly customer service.",
        "ratings": 0.0,
        "images": [
            {
                "public_id": "1_orl6wi",
                "url": "https://res.cloudinary.com/drgoeq3fd/image/upload/v1724858482/1_orl6wi.jpg"
            }
        ],
        "category": "Sports and Outdoors",
        "seller": "Keppi",
        "stock": 60,
        "numOfReviews": 0,
        "reviews": []
    },
    {
        "name": "Kids Walkie Talkies Toys for Boys: comedyfun Mini Robots Walkies Talkies 2 Pack Birthday Gifts for 3 4 5 6-8 Year Old Boys Toys for 4 5 6 7 8-10 Year Old Camping Outdoor Games",
        "price": 17.99,
        "description": "Kid-Friendly Mini Design: Our cute tiny-sized: 1.96 x 1.27 x 4.6 inches and ergonomically designed walkie talkies are adapted to fit small hands between the ages of 3-6. The lightweight and compact design, weighing only 62g, makes it easy for our kids to hold and play with. It is normal that our mini walkie talkies are smaller.\n\nEasy to Use: With simple buttons and a push-to-talk feature, the walkie talkies are incredibly easy to use, making them the great toy for kids aged 3 and up. Locking in on a single channel, kids can have fun without any complex.\n\nCrystal Clear Communication: Advanced clear voice technology ensures that our child's voice is always heard loud and clear. With non-static communication, the walkie talkies have a range of up to 1000 feet in ideal conditions, ensuring that kids always stay connected.\n\nEnduring and Safe: Made from anti-fall ABS material, our walkie talkies can withstand drops of up to 5 feet, making it enduring enough for our kids to use indoors and outdoors. Built-in lanyard hole makes our kids easy to carry their toys around with their favorite lanyard (Not lanyard included).\n\nIdeal Toy Gift for Kids: Packaged in a beautiful gift box, our robot walkie talkies make an ideal Birthday Easter Basket Stuffers gift choice for kids age 3-6-8-10. Whether playing in the backyard or going on camping trips, give our children to start a happy adventure with our mini robot walkie talkies toys.",
        "ratings": 0.0,
        "images": [
            {
                "public_id": "1_ed8lwc",
                "url": "https://res.cloudinary.com/drgoeq3fd/image/upload/v1724858732/1_ed8lwc.jpg"
            }
        ],
        "category": "Toys",
        "seller": "comedyfun",
        "stock": 200,
        "numOfReviews": 0,
        "reviews": []
    }
]